# Завдання 5

x = float(input("Введіть координату x для точки A: "))
y = float(input("Введіть координату y для точки A: "))


if x == 0 and y == 0:
    print("Точка A знаходиться в початку координат.")
elif x == 0:
    print("Точка A знаходиться на вісі Y.")
elif y == 0:
    print("Точка A знаходиться на вісі X.")
elif x > 0 and y > 0:
    print("Точка A знаходиться в першому координатному куті.")
elif x < 0 and y > 0:
    print("Точка A знаходиться в другому координатному куті.")
elif x < 0 and y < 0:
    print("Точка A знаходиться в третьому координатному куті.")
else:
    print("Точка A знаходиться в четвертому координатному куті.")
